target/test-classes/xml/sws/maintainbundle/TC4613_TC003_maintain_add_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sel="http://selfcare.telco.hsntech.com">
  <soapenv:Header/>
  <soapenv:Body>
    <sel:maintainBundleRequest>
      <sel:maintainBundleAction effective="IMMEDIATE" acceptWarning="true">
        <sel:externalSystemId>NETCALL</sel:externalSystemId>
        <sel:accountNumber>$accountNumber$</sel:accountNumber>
        <sel:subscriptionNumber>$subscriptionNumber$</sel:subscriptionNumber>
        <sel:bundleActions>
          <sel:bundleAction actionType="ADD">
            <sel:group>BONUS</sel:group>
            <sel:groupCode>DOUBLE_DATA</sel:groupCode>
            <sel:bundleCode>250MB-4GDATA2-0-FC</sel:bundleCode>
          </sel:bundleAction>
        </sel:bundleActions>
      </sel:maintainBundleAction>
    </sel:maintainBundleRequest>
  </soapenv:Body>
</soapenv:Envelope>